# Titanic Survivor

In [1]:
# Firstly we do Univariant, now we will be doing Multivariant(more than 1 feature)

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
train_df = pd.read_csv(r"C:\Users\prajwal\Downloads\trainTitanic.csv")
test_df = pd.read_csv(r"C:\Users\prajwal\Downloads\testTitanic.csv")

In [4]:
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
train_df.shape

(891, 12)

In [6]:
train_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
# We need to recreate the data in place of Nan(Number so great that cannot be store, missing Data)

In [8]:
# We can use mean, median or mode. We'll prefer mean more in these cases. We will be using median in this because in mean of age, floating number will appear.

In [9]:
train_df['Age'].fillna(train_df['Age'].median(), inplace=True )

C:\Users\prajwal\AppData\Local\Temp\ipykernel_18116\1007164528.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train_df['Age'].fillna(train_df['Age'].median(), inplace=True )

In [10]:
#Filling with train_df median

In [11]:
train_df['Age'] = train_df['Age'].fillna(train_df['Age'].median())

In [12]:
train_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
# Replacing string data(Cabin)

In [14]:
# As there are lots of value unavailable, we will drop the column as it can lead to a lot of human intervention otherwise we will be solving the problem using node(As for string, we prefer this)

In [15]:
# We can create 20Percent human intervention only not 80Percent

In [16]:
train_df.drop('Cabin', inplace = True, axis = 1)   # Axis = 1, means variable is row therefore constant column.

In [17]:
train_df.isna().sum()
# Now we will solve Embarked value

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [18]:
train_df['Embarked'].fillna(train_df['Embarked'].value_counts().idxmax(), inplace = True)   # Pandas to numpy conversion -> value
                                                                                            # To count any value -> value_counts 
                                                                                            # The value which is occuring maximum times we will be using that.

C:\Users\prajwal\AppData\Local\Temp\ipykernel_18116\160697702.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train_df['Embarked'].fillna(train_df['Embarked'].value_counts().idxmax(), inplace = True)   # Pandas to numpy conversion -> value

In [19]:
train_df['Embarked'].value_counts()

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [20]:
train_df['Embarked'].value_counts().idxmax()

'S'

In [21]:
# PassengerId ,name and ticket has no role in Determining result. We will be dropping that.

In [22]:
train_df.drop('PassengerId', axis = 1, inplace = True)
train_df.drop('Name', axis = 1, inplace = True)
train_df.drop('Ticket', axis = 1, inplace = True)

In [23]:
train_df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female  28.0      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]